{
  "dharma": {
    "id": "dharma",
    "label": "Righteous Duty",
    "shortLabel": "Duty",
    "sanskrit": "धर्म",
    "transliteration": "dharma",
    "description": "Honor your responsibilities and role. Act on what is right, not what is convenient.",
    "leadershipContext": "Leaders must understand and fulfill their responsibilities to stakeholders, teams, and society.",
    "keywords": ["duty", "responsibility", "dharma", "obligation", "role", "commitment", "righteous", "right action"],
    "group": "karma",
    "chapterFocus": [2, 3, 18],
    "extendedDescription": "Dharma is the foundational principle of the Bhagavad Gita, representing the cosmic order that sustains life and society. It encompasses your duties, responsibilities, and the right way of living based on your position in life. Unlike rigid rules, dharma is contextual and requires discernment to apply correctly in each situation.",
    "practicalApplication": "In daily life, dharma means fulfilling your commitments—as a professional, family member, citizen, and human being. Ask yourself: What is my duty in this situation? What would a person of integrity do? Then act accordingly, even when it's difficult. For leaders, this means prioritizing team welfare over personal gain and making decisions that serve the greater good.",
    "commonMisconceptions": "Many confuse dharma with blind rule-following or religious obligation. Dharma is not about external compliance but internal alignment with what is right. It's also not about doing what's easy or popular—sometimes dharma requires courage to stand against the crowd.",
    "faqQuestion": "How do I know what my dharma is?",
    "faqAnswer": "Your dharma emerges from understanding your natural abilities, your responsibilities to others, and the needs of the situation. Start by honestly assessing your roles (parent, professional, friend) and the expectations that come with them. Then consider your unique gifts and how they can serve others. When facing difficult choices, ask: What action aligns with truth, benefits others, and maintains my integrity?",
    "relatedPrinciples": ["svadharma", "nishkama_karma", "virtue"]
  },
  "nishkama_karma": {
    "id": "nishkama_karma",
    "label": "Selfless Action",
    "shortLabel": "Selfless Action",
    "sanskrit": "निष्काम कर्म",
    "transliteration": "nishkama karma",
    "description": "Act without attachment to outcomes. Focus on the process, not results.",
    "leadershipContext": "Leaders perform their duties with excellence regardless of recognition or reward.",
    "keywords": ["detachment", "non-attachment", "selfless", "process", "outcomes", "results", "action without desire"],
    "group": "karma",
    "chapterFocus": [2, 3, 5],
    "extendedDescription": "Nishkama Karma is one of the central teachings of the Bhagavad Gita—the concept of performing action without attachment to its fruits. This doesn't mean indifference to quality or lack of goals, but rather freedom from the anxiety and suffering that comes from being overly attached to specific outcomes. When we focus entirely on doing our best in the present moment, we perform better and find greater peace.",
    "practicalApplication": "Apply this principle by giving your full attention to the task at hand rather than constantly calculating potential rewards or worrying about failure. Before starting work, set your intention to do excellent work for its own sake. After completing a task, reflect on what you learned rather than fixating on external validation. In negotiations, focus on creating value rather than 'winning.'",
    "commonMisconceptions": "Nishkama Karma is often misunderstood as passivity or lack of ambition. It's not about having no goals—it's about not letting goals control your peace of mind. You can work hard toward objectives while accepting that outcomes involve factors beyond your control. The key is maintaining equanimity regardless of results.",
    "faqQuestion": "How can I be motivated without attachment to results?",
    "faqAnswer": "True motivation comes from finding meaning in the work itself, not just external rewards. When you're attached to outcomes, anxiety and fear of failure actually impair performance. By focusing on process excellence—doing your best moment to moment—you enter a flow state that produces better results naturally. The paradox is that detachment from outcomes often leads to better outcomes.",
    "relatedPrinciples": ["dharma", "samatvam", "tyaga"]
  },
  "samatvam": {
    "id": "samatvam",
    "label": "Equanimity",
    "shortLabel": "Equanimity",
    "sanskrit": "समत्वम्",
    "transliteration": "samatvam",
    "description": "Remain balanced in success and failure, praise and criticism.",
    "leadershipContext": "Leaders maintain emotional equilibrium regardless of outcomes, modeling stability for their teams.",
    "keywords": ["equanimity", "balance", "evenness", "composure", "stability", "calm", "poise", "equilibrium"],
    "group": "sadachara",
    "chapterFocus": [2, 6, 14],
    "extendedDescription": "Samatvam is the art of maintaining inner equilibrium regardless of external circumstances. The Gita defines yoga itself as 'samatvam'—evenness of mind. This principle teaches us that our response to life's ups and downs matters more than the events themselves. By cultivating equanimity, we become less reactive, make better decisions, and find sustainable peace that doesn't depend on favorable conditions.",
    "practicalApplication": "Practice samatvam by pausing before reacting to good or bad news. Notice your emotional response without immediately acting on it. When praised, acknowledge gracefully without inflating your ego; when criticized, listen for truth without defensiveness. Keep a journal to track emotional patterns and triggers. Regular meditation helps develop this steady awareness.",
    "commonMisconceptions": "Equanimity is not emotional suppression or indifference. You can feel joy and sorrow while maintaining a stable core. It's also not about having no preferences—you can work toward goals while accepting that you cannot control all outcomes. True equanimity is dynamic balance, not rigid stoicism.",
    "faqQuestion": "How do I stay calm when things go wrong?",
    "faqAnswer": "First, remember that your reaction is separate from the event—you have a choice in how you respond. Take three deep breaths before responding to any crisis. Ask yourself: 'Will this matter in a year? In five years?' Focus on what you can control (your response) rather than what you can't (what happened). Regular meditation practice builds the mental muscle of equanimity, making it easier to access during difficult moments.",
    "relatedPrinciples": ["sthitaprajna", "nishkama_karma", "viveka"]
  },
  "sthitaprajna": {
    "id": "sthitaprajna",
    "label": "Steady Wisdom",
    "shortLabel": "Steady Wisdom",
    "sanskrit": "स्थितप्रज्ञ",
    "transliteration": "sthitaprajna",
    "description": "Maintain clarity and stability of mind amidst changing circumstances.",
    "leadershipContext": "Leaders remain composed and clear-thinking during crises and uncertainty.",
    "keywords": ["steady", "stable", "wisdom", "clarity", "composure", "unshaken", "centered", "grounded"],
    "group": "jnana",
    "chapterFocus": [2, 6, 14]
  },
  "dhyana": {
    "id": "dhyana",
    "label": "Meditation",
    "shortLabel": "Meditation",
    "sanskrit": "ध्यान",
    "transliteration": "dhyana",
    "description": "Cultivate inner stillness, focus, and connection through practice.",
    "leadershipContext": "Leaders develop focus and presence through mindful practices that quiet the mind.",
    "keywords": ["meditation", "contemplation", "focus", "stillness", "mindfulness", "concentration", "inner", "awareness"],
    "group": "bhakti",
    "chapterFocus": [6, 8]
  },
  "viveka": {
    "id": "viveka",
    "label": "Discernment",
    "shortLabel": "Discernment",
    "sanskrit": "विवेक",
    "transliteration": "viveka",
    "description": "Distinguish the essential from non-essential, wise from unwise.",
    "leadershipContext": "Leaders make informed decisions by clearly seeing what matters and what doesn't.",
    "keywords": ["discernment", "discrimination", "wisdom", "choice", "judgment", "clarity", "essential", "priorities"],
    "group": "jnana",
    "chapterFocus": [2, 13, 18]
  },
  "jnana": {
    "id": "jnana",
    "label": "Self-Knowledge",
    "shortLabel": "Knowledge",
    "sanskrit": "ज्ञान",
    "transliteration": "jnana",
    "description": "Pursue understanding of self, truth, and the nature of reality.",
    "leadershipContext": "Leaders grow through continuous learning and honest self-assessment.",
    "keywords": ["knowledge", "wisdom", "understanding", "truth", "learning", "self-awareness", "insight", "realization"],
    "group": "jnana",
    "chapterFocus": [4, 7, 13]
  },
  "tyaga": {
    "id": "tyaga",
    "label": "Letting Go",
    "shortLabel": "Letting Go",
    "sanskrit": "त्याग",
    "transliteration": "tyaga",
    "description": "Release attachments to possessions, status, ego, and past.",
    "leadershipContext": "Leaders let go of ego, past failures, and the need for control to move forward effectively.",
    "keywords": ["renunciation", "letting go", "release", "surrender", "detachment", "ego", "freedom", "liberation"],
    "group": "jnana",
    "chapterFocus": [12, 18]
  },
  "bhakti": {
    "id": "bhakti",
    "label": "Devotion",
    "shortLabel": "Devotion",
    "sanskrit": "भक्ति",
    "transliteration": "bhakti",
    "description": "Cultivate love and connection to something greater than yourself.",
    "leadershipContext": "Leaders find purpose in serving something larger than personal ambition.",
    "keywords": ["devotion", "love", "connection", "divine", "surrender", "worship", "dedication", "higher purpose"],
    "group": "bhakti",
    "chapterFocus": [9, 11, 12]
  },
  "shraddha": {
    "id": "shraddha",
    "label": "Faith",
    "shortLabel": "Faith",
    "sanskrit": "श्रद्धा",
    "transliteration": "shraddha",
    "description": "Act with conviction and trust. You become what you believe.",
    "leadershipContext": "Leaders inspire confidence through their own unwavering belief in vision and values.",
    "keywords": ["faith", "conviction", "belief", "trust", "confidence", "dedication", "commitment", "resolve"],
    "group": "bhakti",
    "chapterFocus": [4, 17]
  },
  "sharanagati": {
    "id": "sharanagati",
    "label": "Surrender",
    "shortLabel": "Surrender",
    "sanskrit": "शरणागति",
    "transliteration": "sharanagati",
    "description": "Let go of ego-driven control. Trust in the larger order.",
    "leadershipContext": "Leaders accept what they cannot control and trust in their team and process.",
    "keywords": ["surrender", "trust", "refuge", "acceptance", "letting go", "faith", "submission", "reliance"],
    "group": "bhakti",
    "chapterFocus": [18]
  },
  "discipline": {
    "id": "discipline",
    "label": "Self-Mastery",
    "shortLabel": "Discipline",
    "sanskrit": "संयम",
    "transliteration": "samyama",
    "description": "Control senses, mind, and impulses. Cultivate restraint.",
    "leadershipContext": "Leaders demonstrate self-control and discipline, mastering their own impulses before leading others.",
    "keywords": ["discipline", "self-control", "restraint", "mastery", "control", "temperament", "willpower", "regulation"],
    "group": "sadachara",
    "chapterFocus": [2, 3, 6]
  },
  "virtue": {
    "id": "virtue",
    "label": "Noble Qualities",
    "shortLabel": "Virtue",
    "sanskrit": "दैवी सम्पद्",
    "transliteration": "daivi sampat",
    "description": "Embody divine qualities: truthfulness, courage, compassion, patience.",
    "leadershipContext": "Leaders cultivate and demonstrate virtuous character traits that inspire trust and respect.",
    "keywords": ["virtue", "character", "ethics", "qualities", "values", "integrity", "truthfulness", "courage", "compassion"],
    "group": "sadachara",
    "chapterFocus": [16]
  },
  "svadharma": {
    "id": "svadharma",
    "label": "True to Your Nature",
    "shortLabel": "Your Nature",
    "sanskrit": "स्वधर्म",
    "transliteration": "svadharma",
    "description": "Align work with your innate strengths and authentic self.",
    "leadershipContext": "Leaders match responsibilities to natural capabilities and temperament, both for themselves and their teams.",
    "keywords": ["nature", "authentic", "strengths", "temperament", "calling", "role fit", "innate", "self"],
    "group": "karma",
    "chapterFocus": [3, 18]
  },
  "seva": {
    "id": "seva",
    "label": "Selfless Service",
    "shortLabel": "Service",
    "sanskrit": "सेवा",
    "transliteration": "seva",
    "description": "Act for the welfare of others without expectation. Lead by personal example.",
    "leadershipContext": "Leaders serve their teams and stakeholders, leading through personal action rather than just direction.",
    "keywords": ["service", "selfless", "welfare", "others", "example", "role model", "compassion", "helping"],
    "group": "karma",
    "chapterFocus": [3, 12, 16]
  },
  "abhyasa": {
    "id": "abhyasa",
    "label": "Practice",
    "shortLabel": "Practice",
    "sanskrit": "अभ्यास",
    "transliteration": "abhyasa",
    "description": "Persist through consistent effort. Growth comes through repetition.",
    "leadershipContext": "Leaders develop skills and wisdom through persistent, deliberate practice over time.",
    "keywords": ["practice", "repetition", "consistency", "effort", "persistence", "training", "habit", "discipline", "routine"],
    "group": "sadachara",
    "chapterFocus": [6, 12]
  }
}
